package com.example.productscanner.Restrictions

object Restrictions {
    private val restrictionWords = mapOf(

        "Сахар" to setOf(
            "сахар(ный|а|е)?", "глюкоза", "фруктоза", "сироп", "мёд", "патока",
            "сорбитол", "мальтитол", "ксилит", "эритрол", "сахарозаменители",
            "сахарный спирт", "сахарный сироп", "сахарная пудра", "декстроза",
            "глицерин", "изомальт", "тростниковый сахар", "рафинад",
            "сахарный песок", "сухой сахар", "глюкозо-фруктозный сироп",
            "инвертный сахар", "каррагинан", "кленовый сироп", "изомальтоза",
            "ацесульфам калия", "сукралоза"
        ),

        "Глютен" to setOf(
            "глютен(овый)?", "пшеница", "рожь", "ячмень", "овес", "куса-куса",
            "булгур", "тритикале", "манка", "крахмал(из пшеницы)?",
            "пшеничная мука", "овсяная мука", "ржаная мука", "пшеничный крахмал",
            "глютеновая смесь"
        ),
        "Лактоза" to setOf(
            "молоко", "лактоза", "молочный", "кефир", "сливки", "сыр", "йогурт",
            "сметана", "масло", "молочный продукт", "молочный белок",
            "сгущенное молоко", "плавленый сыр", "творог", "мороженое",
            "казеин", "латте", "какао с молоком"
        ),
        "Орехи" to setOf(
            "орех(и|овый)?", "арахис", "миндаль", "фундук", "грецкий", "кешью",
            "фисташки", "бразильский орех", "кокос", "пекан", "пиния",
            "кедровый орех", "макадамия"
        ),
        "Яйца" to setOf(
            "яйцо(а)?", "омлет", "майонез", "альбумин", "лецитин",
            "яичный порошок", "яичный белок", "яичный желток", "яичный протеин"
        ),
        "Рыба/морепродукты" to setOf(
            "рыба", "морепродукты", "креветки", "краб", "устрицы", "мидии",
            "кальмар", "осминог", "рапан", "анчоусы", "лосось", "сельдь",
            "тунец", "сибас", "щука", "палтус", "минтай", "каракатица"
        )
    )

    val compiledPatterns: Map<String, Regex> by lazy {
        restrictionWords.mapValues { (_, words) ->
            Regex("\\b(${words.joinToString("|")})\\b", RegexOption.IGNORE_CASE)
        }
    }
}
